Repository: Avid29/MIPSer
Catalog: src/Apps/Mipser.Windows/Strings/*/Resources.resw
Source language: en_us
Languages: he_il

# EditMBI.Title
source: Edit
he_il: ערוך

# FileMBI.Title
source: File
he_il: קבוץ

# CutMFI.Text
source: Cut
he_il: גזור

# CopyMFI.Text
source: Copy
he_il: העתק

# PasteMFI.Text
source: Paste
he_il: הדבק

# RedoMFI.Text
source: Redo
he_il: בצע שוב

# UndoMFI.Text
source: Undo
he_il: בטל פעולה

# CloseFileMFI.Text
source: Close File
he_il: סגור קובץ

# SaveAllMFI.Text
source: Save All
he_il: שמור הכל

# SaveMFI.Text
source: Save
he_il: שמור

# NewFileMFI.Text
source: New File
he_il: קובץ חדש

# OpenFolderMFI.Text
source: Open Folder
he_il: פתח תיקייה

# OpenMFI.Text
source: Open
he_il: פתח

# OpenFileMFI.Text
source: Open File
he_il: פתח קובץ

source: New File
he_il: קובץ חדש

# HelpMBI.Title
source: Help
he_il: עזרה

# ViewMBI.Title
source: View
he_il: הצג

# ToggleFullScreenMFI.Text
source: Toggle Full Screen
he_il: הפעלה/כיבוי מסך מלא

# CheatSheetMFI.Text
source: Show Cheat Sheet
he_il: הצג גיליון רמאות

# AboutMFI.Text
source: About Mipser
he_il: אודות Mipser

source: Arithmetic (Signed)
he_il: חשבון (עם סימן)

source: Arithmetic (Unsigned)
he_il: חשבון (ללא סימן)

source: Logical
he_il: לוגית

source: Data
he_il: נתונים

source: Memory
he_il: זיכרון

source: Jump
he_il: קיפוץ

source: Branch
he_il: הסתעפות

source: Compare
he_il: השוואה

source: System
he_il: מערכת

# Usage_shift
source: shift
he_il: הזזה

# Usage_address
source: address
he_il: כתובת

# Usage_offset
source: offset
he_il: היסט

# Usage_immediate
source: immediate
he_il: מיידי

# CommonInstructionsTB.Text
source: Common Instruction
he_il: הוראות משותפות

source: Move
he_il: העברה

source: Interrupts
he_il: פסיקות

# CoProc0InstructionsTB.Text
source: CoProcessor0 Instruction
he_il: הוראות מעבד-משנה 0

source: Debug
he_il: ניפוי שגיאות

source: Translation Lookaside Buffer
he_il: מטמון תרגום כתובות (TLB)

# SpecializedInstructionsTB.Text
source: Specialized Instructions
he_il: הוראות מיוחדות

source: Trap
he_il: מלכודת

source: Floating-Point Arithmetic
he_il: חשבון נקודה צפה

source: Floating-Point Rounding
he_il: עיגול נקודה צפה

source: Floating-Point Conversion
he_il: המרת נקודה צפה

source: Conditional Move
he_il: העברה מותנית
